def mse(pred, true):
    diff = [(p[0] - t[0]) ** 2 + (p[1] - t[1]) ** 2 for p, t in zip(pred, true)]
    deviation = sum(diff) / len(diff)
    return deviation


# Тесты для функции mse для двумерных векторов
assert mse([(1, 2), (3, 4)],
           [(1, 2), (3, 4)]) == 0, f"Ожидаемый ответ: 0, Текущий ответ: {mse([(1, 2), (3, 4)], [(1, 2), (3, 4)])}"
assert mse([(1, 2), (3, 4)],
           [(1, 2), (3, 5)]) == 0.5, f"Ожидаемый ответ: 0.5, Текущий ответ: {mse([(1, 2), (3, 4)], [(1, 2), (3, 5)])}"
assert mse([(0, 0), (0, 0)],
           [(1, 1), (1, 1)]) == 2.0, f"Ожидаемый ответ: 2.0, Текущий ответ: {mse([(0, 0), (0, 0)], [(1, 1), (1, 1)])}"
assert mse([(5, 5), (6, 7)],
           [(5, 5), (8, 9)]) == 4.0, f"Ожидаемый ответ: 4.0, Текущий ответ: {mse([(5, 5), (6, 7)], [(5, 5), (8, 9)])}"

print("Все тесты пройдены!")
